9/data/attachments/89501bea70c317d4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_reason_Friend_66941_9</nif:username>
            <nif:friendToBeRequested>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>